sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.h
/*!
    \file    gd32a7xx_mfcom.h
    \brief   MFCOM driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_MFCOM_H
#define GD32A7XX_MFCOM_H

#include "gd32a7xx.h"

/* MFCOM definitions */
#define MFCOM                           MFCOM_BASE                               /*!< MFCOM base address */

/* registers definitions */
#define MFCOM_CTL                       REG32(MFCOM + 0x00000000U)               /*!< MFCOM control register */
#define MFCOM_PINDATA                   REG32(MFCOM + 0x00000004U)               /*!< MFCOM pin data register */
#define MFCOM_SSTAT                     REG32(MFCOM + 0x00000008U)               /*!< MFCOM shifter status register */
#define MFCOM_SERR                      REG32(MFCOM + 0x0000000CU)               /*!< MFCOM shifter error register */
#define MFCOM_TMSTAT                    REG32(MFCOM + 0x00000010U)               /*!< MFCOM timer status register */
#define MFCOM_SSIEN                     REG32(MFCOM + 0x00000018U)               /*!< MFCOM shifter status interrupt enable register */
#define MFCOM_SEIEN                     REG32(MFCOM + 0x0000001CU)               /*!< MFCOM shifter error interrupt enable register */
#define MFCOM_TMSIEN                    REG32(MFCOM + 0x00000020U)               /*!< MFCOM timer status interrupt enable register */
#define MFCOM_SSDMAEN                   REG32(MFCOM + 0x00000028U)               /*!< MFCOM shifter status dma enable register */
#define MFCOM_SCTL(x)                   REG32(MFCOM + 0x00000080U + (x) * 4U)    /*!< MFCOM shifter x control register */
#define MFCOM_SCFG(x)                   REG32(MFCOM + 0x00000100U + (x) * 4U)    /*!< MFCOM shifter x configuration register */
#define MFCOM_SBUF(x)                   REG32(MFCOM + 0x00000200U + (x) * 4U)    /*!< MFCOM shifter buffer x register */
#define MFCOM_SBUFBIS(x)                REG32(MFCOM + 0x00000280U + (x) * 4U)    /*!< MFCOM shifter buffer x bit swapped register  */
#define MFCOM_SBUFBYS(x)                REG32(MFCOM + 0x00000300U + (x) * 4U)    /*!< MFCOM shifter buffer x byte swapped register */
#define MFCOM_SBUFBBS(x)                REG32(MFCOM + 0x00000380U + (x) * 4U)    /*!< MFCOM shifter buffer x bit byte swapped register */
#define MFCOM_TMCTL(x)                  REG32(MFCOM + 0x00000400U + (x) * 4U)    /*!< MFCOM timer x control register */
#define MFCOM_TMCFG(x)                  REG32(MFCOM + 0x00000480U + (x) * 4U)    /*!< MFCOM timer x configuration register */
#define MFCOM_TMCMP(x)                  REG32(MFCOM + 0x00000500U + (x) * 4U)    /*!< MFCOM timer x compare register */

/* bits definitions */
/* MFCOM_CTL */
#define MFCOM_CTL_MFCOMEN               BIT(0)                                   /*!< MFCOM enable */ 
#define MFCOM_CTL_SWRSTEN               BIT(1)                                   /*!< software reset enable */

/* MFCOM_PINDATA */
#define MFCOM_PINDATA_PDATA             BITS(0,7)                                /*!< input data of pins */

/* MFCOM_SSTAT */
#define MFCOM_SSTAT_SSTAT               BITS(0,3)                                /*!< shifter x status flag */

/* MFCOM_SERR */
#define MFCOM_SERR_SERR                 BITS(0,3)                                /*!< shifter x error flags */

/* MFCOM_TMSTAT */
#define MFCOM_TMSTAT_TMSTAT             BITS(0,3)                                /*!< timer x status flags */

/* MFCOM_SSIEN */
#define MFCOM_SSIEN_SSIEN               BITS(0,3)                                /*!< shifter status interrupt enable */

/* MFCOM_SEIEN */
#define MFCOM_SEIEN_SEIEN               BITS(0,3)                                /*!< shifter error interrupt enable */

/* MFCOM_TMSIEN */
#define MFCOM_TMSIEN_TMSIEN             BITS(0,3)                                /*!< timer status interrupt enable */

/* MFCOM_SSDMAEN */
#define MFCOM_SSDMAEN_SSDMAEN           BITS(0,3)                                /*!< shifter status DMA enable */

/* MFCOM_SCTLx */
#define MFCOM_SCTL_SMOD                 BITS(0,2)                                /*!< shifter mode */
#define MFCOM_SCTL_SPPL                 BIT(7)                                   /*!< shifter pin polarity */
#define MFCOM_SCTL_SPSEL                BITS(8,10)                               /*!< shifter pin select */
#define MFCOM_SCTL_SPCFG                BITS(16,17)                              /*!< shifter pin configuration */
#define MFCOM_SCTL_TMPL                 BIT(23)                                  /*!< timer polarity */
#define MFCOM_SCTL_TMSEL                BITS(24,25)                              /*!< timer select */

