sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.h
/* MFCOM timer trigger polarity */
#define MFCOM_TIMER_TRGPOL_ACTIVE_HIGH           ((uint32_t)0x00000000U)                               /*!< active high */
#define MFCOM_TIMER_TRGPOL_ACTIVE_LOW            MFCOM_TMCTL_TRIGPL                                    /*!< active low */

/* MFCOM timer pin config */
#define TMCTL_TMPCFG(regval)                     (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define MFCOM_TIMER_PINCFG_INPUT                 TMCTL_TMPCFG(0)                                       /*!< pin input */
#define MFCOM_TIMER_PINCFG_OPENDRAIN             TMCTL_TMPCFG(1)                                       /*!< pin open drain */
#define MFCOM_TIMER_PINCFG_BIDI                  TMCTL_TMPCFG(2)                                       /*!< pin cascade input/output */
#define MFCOM_TIMER_PINCFG_OUTPUT                TMCTL_TMPCFG(3)                                       /*!< pin output */

/* MFCOM timer pin select */
#define TMCTL_TMPSEL(regval)                     (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define MFCOM_TIMER_PINSEL_PIN0                  TMCTL_TMPSEL(0)                                       /*!< timer Pin 0 selected */
#define MFCOM_TIMER_PINSEL_PIN1                  TMCTL_TMPSEL(1)                                       /*!< timer Pin 1 selected */
#define MFCOM_TIMER_PINSEL_PIN2                  TMCTL_TMPSEL(2)                                       /*!< timer Pin 2 selected */
#define MFCOM_TIMER_PINSEL_PIN3                  TMCTL_TMPSEL(3)                                       /*!< timer Pin 3 selected */
#define MFCOM_TIMER_PINSEL_PIN4                  TMCTL_TMPSEL(4)                                       /*!< timer Pin 4 selected */
#define MFCOM_TIMER_PINSEL_PIN5                  TMCTL_TMPSEL(5)                                       /*!< timer Pin 5 selected */
#define MFCOM_TIMER_PINSEL_PIN6                  TMCTL_TMPSEL(6)                                       /*!< timer Pin 6 selected */
#define MFCOM_TIMER_PINSEL_PIN7                  TMCTL_TMPSEL(7)                                       /*!< timer Pin 7 selected */

/* MFCOM timer pin polarity */
#define MFCOM_TIMER_PINPOL_ACTIVE_HIGH           ((uint32_t)0x00000000U)                               /*!< active high */
#define MFCOM_TIMER_PINPOL_ACTIVE_LOW            MFCOM_TMCTL_TMPPL                                     /*!< active low */

/* MFCOM timer mode */
#define TMCTL_TMMOD(regval)                      (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define MFCOM_TIMER_DISABLE                      TMCTL_TMMOD(0)                                        /*!< timer disabled. */
#define MFCOM_TIMER_BAUDMODE                     TMCTL_TMMOD(1)                                        /*!< dual 8-bit counters baud/bit mode */
#define MFCOM_TIMER_PWMMODE                      TMCTL_TMMOD(2)                                        /*!< dual 8-bit counters PWM mode */
#define MFCOM_TIMER_16BITCOUNTER                 TMCTL_TMMOD(3)                                        /*!< single 16-bit counter mode */

/* MFCOM timer output */
#define TMCFG_TMOUT(regval)                      (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define MFCOM_TIMER_OUT_HIGH_EN                  TMCFG_TMOUT(0)                                        /*!< logic one when enabled and is not affected by timer reset */
#define MFCOM_TIMER_OUT_LOW_EN                   TMCFG_TMOUT(1)                                        /*!< logic zero when enabled and is not affected by timer reset */
#define MFCOM_TIMER_OUT_HIGH_EN_RESET            TMCFG_TMOUT(2)                                        /*!< logic one when enabled and on timer reset */
#define MFCOM_TIMER_OUT_LOW_EN_RESET             TMCFG_TMOUT(3)                                        /*!< logic zero when enabled and on timer reset */

/* MFCOM timer decrement */
#define TMCFG_TMDEC(regval)                      (BITS(20,21) & ((uint32_t)(regval) << 20U))
#define MFCOM_TIMER_DEC_CLK_SHIFT_OUT            TMCFG_TMDEC(0)                                        /*!< decrement counter on MFCOM clock, shift clock equals timer output */
#define MFCOM_TIMER_DEC_TRIG_SHIFT_OUT           TMCFG_TMDEC(1)                                        /*!< decrement counter on trigger input (both edges), shift clock equals timer output */
#define MFCOM_TIMER_DEC_PIN_SHIFT_PIN            TMCFG_TMDEC(2)                                        /*!< decrement counter on pin input (both edges), shift clock equals Pin input */
#define MFCOM_TIMER_DEC_TRIG_SHIFT_TRIG          TMCFG_TMDEC(3)                                        /*!< decrement counter on trigger input (both edges), shift clock equals trigger input */

/* MFCOM timer reset */
#define TMCFG_TMRST(regval)                      (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define MFCOM_TIMER_RESET_NEVER                  TMCFG_TMRST(0)                                        /*!< timer never reset */
#define MFCOM_TIMER_RESET_PIN_TIMOUT             TMCFG_TMRST(2)                                        /*!< timer reset on timer pin equal to timer output */
#define MFCOM_TIMER_RESET_TRIG_TIMOUT            TMCFG_TMRST(3)                                        /*!< timer reset on timer trigger equal to timer output */
#define MFCOM_TIMER_RESET_PIN_RISING             TMCFG_TMRST(4)                                        /*!< timer reset on timer pin rising edge */
#define MFCOM_TIMER_RESET_TRIG_RISING            TMCFG_TMRST(6)                                        /*!< timer reset on trigger rising edge */
#define MFCOM_TIMER_RESET_TRIG_BOTH              TMCFG_TMRST(7)                                        /*!< timer reset on trigger rising or falling edge */

/* MFCOM timer disable */
#define TMCFG_TMDIS(regval)                      (BITS(12,14) & ((uint32_t)(regval) << 12U))
#define MFCOM_TIMER_DISMODE_NEVER                TMCFG_TMDIS(0)                                        /*!< timer never disabled */
#define MFCOM_TIMER_DISMODE_PRE_TIMDIS           TMCFG_TMDIS(1)                                        /*!< timer disabled on timer x-1 disable */
#define MFCOM_TIMER_DISMODE_COMPARE              TMCFG_TMDIS(2)                                        /*!< timer disabled on timer compare */
#define MFCOM_TIMER_DISMODE_COMPARE_TRIGLOW      TMCFG_TMDIS(3)                                        /*!< timer disabled on timer compare and trigger Low */
#define MFCOM_TIMER_DISMODE_PINBOTH              TMCFG_TMDIS(4)                                        /*!< timer disabled on pin rising or falling edge */
#define MFCOM_TIMER_DISMODE_PINBOTH_TRIGHIGH     TMCFG_TMDIS(5)                                        /*!< timer disabled on pin rising or falling edge provided trigger is high */
#define MFCOM_TIMER_DISMODE_TRIGFALLING          TMCFG_TMDIS(6)                                        /*!< timer disabled on trigger falling edge */

/* MFCOM timer enable */
#define TMCFG_TMEN(regval)                       (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define MFCOM_TIMER_ENMODE_ALWAYS                TMCFG_TMEN(0)                                         /*!< timer always enabled */
#define MFCOM_TIMER_ENMODE_PRE_TIMEN             TMCFG_TMEN(1)                                         /*!< timer enabled on timer x-1 enable */
#define MFCOM_TIMER_ENMODE_TRIGHIGH              TMCFG_TMEN(2)                                         /*!< timer enabled on trigger high */
#define MFCOM_TIMER_ENMODE_TRIGHIGH_PINHIGH      TMCFG_TMEN(3)                                         /*!< timer enabled on trigger high and Pin high */
#define MFCOM_TIMER_ENMODE_PINRISING             TMCFG_TMEN(4)                                         /*!< timer enabled on pin rising edge */
#define MFCOM_TIMER_ENMODE_PINRISING_TRIGHIGH    TMCFG_TMEN(5)                                         /*!< timer enabled on pin rising edge and trigger high */
#define MFCOM_TIMER_ENMODE_TRIGRISING            TMCFG_TMEN(6)                                         /*!< timer enabled on trigger rising edge */
#define MFCOM_TIMER_ENMODE_TRIGBOTH              TMCFG_TMEN(7)                                         /*!< timer enabled on trigger rising or falling edge */

