sorosaulong-ux/gd32-test-project/Library/gd32a7xx_mfcom.h
/* MFCOM shifter number */
typedef enum {
    MFCOM_SHIFTER_0 = 0x0U,                                                                            /*!< MFCOM shifter0 */
    MFCOM_SHIFTER_1,                                                                                   /*!< MFCOM shifter1 */
    MFCOM_SHIFTER_2,                                                                                   /*!< MFCOM shifter2 */
    MFCOM_SHIFTER_3                                                                                    /*!< MFCOM shifter3 */
}mfcom_shifter_enum;

/* MFCOM timer number */
typedef enum { 
    MFCOM_TIMER_0 = 0x0U,                                                                              /*!< MFCOM timer0 */
    MFCOM_TIMER_1,                                                                                     /*!< MFCOM timer1 */
    MFCOM_TIMER_2,                                                                                     /*!< MFCOM timer2 */
    MFCOM_TIMER_3                                                                                      /*!< MFCOM timer3 */
}mfcom_timer_enum;

/* MFCOM read write mode */
#define MFCOM_RWMODE_NORMAL                     ((uint32_t)0x00000000U)                                /*!< read and write in normal mode */
#define MFCOM_RWMODE_BITSWAP                    ((uint32_t)0x00000001U)                                /*!< read and write in bit swapped mode */
#define MFCOM_RWMODE_BYTESWAP                   ((uint32_t)0x00000002U)                                /*!< read and write in byte swapped mode */
#define MFCOM_RWMODE_BITBYTESWAP                ((uint32_t)0x00000003U)                                /*!< read and write in bit byte swapped mode */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check the MFCOM TIMER pin configuration */
#define NOT_MFCOM_TIMER_PINCFG(mode)            (((mode) != MFCOM_TIMER_PINCFG_INPUT)     && ((mode) != MFCOM_TIMER_PINCFG_OPENDRAIN) && \
                                                ((mode) != MFCOM_TIMER_PINCFG_BIDI)      && ((mode) != MFCOM_TIMER_PINCFG_OUTPUT))

/* check the MFCOM shifter pin configuration */
#define NOT_MFCOM_SHIFTER_PINCFG(mode)          (((mode) != MFCOM_SHIFTER_PINCFG_INPUT)     && ((mode) != MFCOM_SHIFTER_PINCFG_OPENDRAIN) && \
                                                ((mode) != MFCOM_SHIFTER_PINCFG_BIDI)      && ((mode) != MFCOM_SHIFTER_PINCFG_OUTPUT))

/* check the MFCOM TIMER mode */
#define NOT_MFCOM_TIMER_MODE(timermode)         (((timermode) != MFCOM_TIMER_DISABLE)      && ((timermode) != MFCOM_TIMER_BAUDMODE) && \
                                                ((timermode) != MFCOM_TIMER_PWMMODE)      && ((timermode) != MFCOM_TIMER_16BITCOUNTER))

/* check the MFCOM shifter mode */
#define NOT_MFCOM_SHIFTER_MODE(shiftermode)     (((shiftermode) != MFCOM_SHIFTER_DISABLE)          && ((shiftermode) != MFCOM_SHIFTER_RECEIVE) && \
                                                ((shiftermode) != MFCOM_SHIFTER_TRANSMIT))

/* check the MFCOM TIMER dismode */
#define NOT_MFCOM_TIMER_DISMODE(dismode)        (((dismode) != MFCOM_TIMER_DISMODE_NEVER)            && ((dismode) != MFCOM_TIMER_DISMODE_PRE_TIMDIS) && \
                                                ((dismode) != MFCOM_TIMER_DISMODE_COMPARE)          && ((dismode) != MFCOM_TIMER_DISMODE_COMPARE_TRIGLOW) && \
                                                ((dismode) != MFCOM_TIMER_DISMODE_PINBOTH)          && ((dismode) != MFCOM_TIMER_DISMODE_PINBOTH_TRIGHIGH) && \
                                                ((dismode) != MFCOM_TIMER_DISMODE_TRIGFALLING))

/* check the MFCOM shifter stop bit */
#define NOT_MFCOM_SHIFTER_STOPBIT(stopbit)      (((stopbit) != MFCOM_SHIFTER_STOPBIT_DISABLE) && ((stopbit) != MFCOM_SHIFTER_STOPBIT_LOW) && \
                                                ((stopbit) != MFCOM_SHIFTER_STOPBIT_HIGH))

/* check the MFCOM TIMER rwmode */
#define NOT_MFCOM_RWMODE(rwmode)                (((rwmode) != MFCOM_RWMODE_NORMAL)      && ((rwmode) != MFCOM_RWMODE_BITSWAP) && \
                                                ((rwmode) != MFCOM_RWMODE_BYTESWAP)    && ((rwmode) != MFCOM_RWMODE_BITBYTESWAP))

#endif /* FW_DEBUG_ERR_REPORT */


/* function declarations */
/* reset MFCOM */
void mfcom_deinit(void);
/* software reset */
void mfcom_software_reset(void);
/* enable MFCOM function */
void mfcom_enable(void);
/* disable MFCOM function */
void mfcom_disable(void);
/* initialize mfcom_timer_parameter_struct with the default values */
void mfcom_timer_struct_para_init(mfcom_timer_parameter_struct* init_struct);
/* initialize mfcom_shifter_parameter_struct with the default values */
void mfcom_shifter_struct_para_init(mfcom_shifter_parameter_struct* init_struct);

/* initialize MFCOM timer */
void mfcom_timer_init(mfcom_timer_enum timer, mfcom_timer_parameter_struct* init_struct);
/* initialize MFCOM shifter */
void mfcom_shifter_init(mfcom_shifter_enum shifter, mfcom_shifter_parameter_struct* init_struct);

/* configure timer pin mode */
void mfcom_timer_pin_config(mfcom_timer_enum timer, uint32_t mode);
/* configure shifter pin mode */
void mfcom_shifter_pin_config(mfcom_shifter_enum shifter, uint32_t mode);
/* enable MFCOM timer in specific mode */
void mfcom_timer_enable(mfcom_timer_enum timer, uint32_t timermode);
/* enable MFCOM shifter in specific mode */
void mfcom_shifter_enable(mfcom_shifter_enum shifter, uint32_t shiftermode);
/* disable MFCOM timer */
void mfcom_timer_disable(mfcom_timer_enum timer);
/* disable MFCOM shifter */
void mfcom_shifter_disable(mfcom_shifter_enum shifter);

/* set the timer compare value */
void mfcom_timer_cmpvalue_set(mfcom_timer_enum timer, uint32_t compare);
/* get the timer compare value */
uint32_t mfcom_timer_cmpvalue_get(mfcom_timer_enum timer);
/* set the timer disable source */
void mfcom_timer_dismode_set(mfcom_timer_enum timer, uint32_t dismode);

/* set the shifter stopbit */
void mfcom_shifter_stopbit_set(mfcom_shifter_enum shifter, uint32_t stopbit);
/* write MFCOM shifter buffer */
void mfcom_buffer_write(mfcom_shifter_enum shifter, uint32_t data, uint32_t rwmode);
/* read MFCOM shifter buffer */
uint32_t mfcom_buffer_read(mfcom_shifter_enum shifter, uint32_t rwmode);
/* get MFCOM shifter flag */
FlagStatus mfcom_shifter_flag_get(mfcom_shifter_enum shifter);
/* get MFCOM shifter error flag */
FlagStatus mfcom_shifter_error_flag_get(mfcom_shifter_enum shifter);
/* get MFCOM timer flag */
FlagStatus mfcom_timer_flag_get(mfcom_timer_enum timer);

/* flag and interrupt functions */
/* get MFCOM shifter interrupt flag */
FlagStatus mfcom_shifter_interrupt_flag_get(mfcom_shifter_enum shifter);
/* get MFCOM shifter error interrupt flag */
FlagStatus mfcom_shifter_error_interrupt_flag_get(mfcom_shifter_enum shifter);
/* get MFCOM timer interrupt flag */
FlagStatus mfcom_timer_interrupt_flag_get(mfcom_timer_enum timer);

/* clear MFCOM shifter flag */
void mfcom_shifter_flag_clear(mfcom_shifter_enum shifter);
/* clear MFCOM shifter error flag */
void mfcom_shifter_error_flag_clear(mfcom_shifter_enum shifter);
/* clear MFCOM timer flag */
void mfcom_timer_flag_clear(mfcom_timer_enum timer);

/* enable MFCOM shifter interrupt */
void mfcom_shifter_interrupt_enable(mfcom_shifter_enum shifter);
/* enable MFCOM shifter error interrupt */
void mfcom_shifter_error_interrupt_enable(mfcom_shifter_enum shifter);
/* enable MFCOM timer interrupt */
void mfcom_timer_interrupt_enable(mfcom_timer_enum timer);
/* enable MFCOM shifter dma */
void mfcom_shifter_dma_enable(mfcom_shifter_enum shifter);

/* disable MFCOM shifter interrupt */
void mfcom_shifter_interrupt_disable(mfcom_shifter_enum shifter);
/* disable MFCOM shifter error interrupt */
void mfcom_shifter_error_interrupt_disable(mfcom_shifter_enum shifter);
/* disable MFCOM timer interrupt */
void mfcom_timer_interrupt_disable(mfcom_timer_enum timer);
/* disable MFCOM shifter dma */
void mfcom_shifter_dma_disable(mfcom_shifter_enum shifter);

#endif /* GD32A7XX_MFCOM_H */
